Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMtu_bf.h
/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU0_PCMAP */
#define IFX_MTU_MEMMAP_CPU0_PCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU0_PCMAP */
#define IFX_MTU_MEMMAP_CPU0_PCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU0_PCMAP */
#define IFX_MTU_MEMMAP_CPU0_PCMAP_OFF (2u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU0_PTMAP */
#define IFX_MTU_MEMMAP_CPU0_PTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU0_PTMAP */
#define IFX_MTU_MEMMAP_CPU0_PTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU0_PTMAP */
#define IFX_MTU_MEMMAP_CPU0_PTMAP_OFF (3u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU1_DCMAP */
#define IFX_MTU_MEMMAP_CPU1_DCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU1_DCMAP */
#define IFX_MTU_MEMMAP_CPU1_DCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU1_DCMAP */
#define IFX_MTU_MEMMAP_CPU1_DCMAP_OFF (5u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU1_DTMAP */
#define IFX_MTU_MEMMAP_CPU1_DTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU1_DTMAP */
#define IFX_MTU_MEMMAP_CPU1_DTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU1_DTMAP */
#define IFX_MTU_MEMMAP_CPU1_DTMAP_OFF (6u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU1_PCMAP */
#define IFX_MTU_MEMMAP_CPU1_PCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU1_PCMAP */
#define IFX_MTU_MEMMAP_CPU1_PCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU1_PCMAP */
#define IFX_MTU_MEMMAP_CPU1_PCMAP_OFF (7u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU1_PTMAP */
#define IFX_MTU_MEMMAP_CPU1_PTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU1_PTMAP */
#define IFX_MTU_MEMMAP_CPU1_PTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU1_PTMAP */
#define IFX_MTU_MEMMAP_CPU1_PTMAP_OFF (8u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU2_DCMAP */
#define IFX_MTU_MEMMAP_CPU2_DCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU2_DCMAP */
#define IFX_MTU_MEMMAP_CPU2_DCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU2_DCMAP */
#define IFX_MTU_MEMMAP_CPU2_DCMAP_OFF (10u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU2_DTMAP */
#define IFX_MTU_MEMMAP_CPU2_DTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU2_DTMAP */
#define IFX_MTU_MEMMAP_CPU2_DTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU2_DTMAP */
#define IFX_MTU_MEMMAP_CPU2_DTMAP_OFF (11u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU2_PCMAP */
#define IFX_MTU_MEMMAP_CPU2_PCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU2_PCMAP */
#define IFX_MTU_MEMMAP_CPU2_PCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU2_PCMAP */
#define IFX_MTU_MEMMAP_CPU2_PCMAP_OFF (12u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU2_PTMAP */
#define IFX_MTU_MEMMAP_CPU2_PTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU2_PTMAP */
#define IFX_MTU_MEMMAP_CPU2_PTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU2_PTMAP */
#define IFX_MTU_MEMMAP_CPU2_PTMAP_OFF (13u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU3_DCMAP */
#define IFX_MTU_MEMMAP_CPU3_DCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU3_DCMAP */
#define IFX_MTU_MEMMAP_CPU3_DCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU3_DCMAP */
#define IFX_MTU_MEMMAP_CPU3_DCMAP_OFF (15u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU3_DTMAP */
#define IFX_MTU_MEMMAP_CPU3_DTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU3_DTMAP */
#define IFX_MTU_MEMMAP_CPU3_DTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU3_DTMAP */
#define IFX_MTU_MEMMAP_CPU3_DTMAP_OFF (16u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU3_PCMAP */
#define IFX_MTU_MEMMAP_CPU3_PCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU3_PCMAP */
#define IFX_MTU_MEMMAP_CPU3_PCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU3_PCMAP */
#define IFX_MTU_MEMMAP_CPU3_PCMAP_OFF (17u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU3_PTMAP */
#define IFX_MTU_MEMMAP_CPU3_PTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU3_PTMAP */
#define IFX_MTU_MEMMAP_CPU3_PTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU3_PTMAP */
#define IFX_MTU_MEMMAP_CPU3_PTMAP_OFF (18u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU4_DCMAP */
#define IFX_MTU_MEMMAP_CPU4_DCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU4_DCMAP */
#define IFX_MTU_MEMMAP_CPU4_DCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU4_DCMAP */
#define IFX_MTU_MEMMAP_CPU4_DCMAP_OFF (20u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU4_DTMAP */
#define IFX_MTU_MEMMAP_CPU4_DTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU4_DTMAP */
#define IFX_MTU_MEMMAP_CPU4_DTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU4_DTMAP */
#define IFX_MTU_MEMMAP_CPU4_DTMAP_OFF (21u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU4_PCMAP */
#define IFX_MTU_MEMMAP_CPU4_PCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU4_PCMAP */
#define IFX_MTU_MEMMAP_CPU4_PCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU4_PCMAP */
#define IFX_MTU_MEMMAP_CPU4_PCMAP_OFF (22u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU4_PTMAP */
#define IFX_MTU_MEMMAP_CPU4_PTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU4_PTMAP */
#define IFX_MTU_MEMMAP_CPU4_PTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU4_PTMAP */
#define IFX_MTU_MEMMAP_CPU4_PTMAP_OFF (23u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU5_DCMAP */
#define IFX_MTU_MEMMAP_CPU5_DCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU5_DCMAP */
#define IFX_MTU_MEMMAP_CPU5_DCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU5_DCMAP */
#define IFX_MTU_MEMMAP_CPU5_DCMAP_OFF (25u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU5_DTMAP */
#define IFX_MTU_MEMMAP_CPU5_DTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU5_DTMAP */
#define IFX_MTU_MEMMAP_CPU5_DTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU5_DTMAP */
#define IFX_MTU_MEMMAP_CPU5_DTMAP_OFF (26u)

