Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxMtu_bf.h
/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU1_DLMU_STBY_FDA */
#define IFX_MTU_MEMFDA0_CPU1_DLMU_STBY_FDA_OFF (9u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DMEM_FDA_OFF (10u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DTAG_FDA_OFF (11u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PMEM_FDA_OFF (12u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU2_PTAG_FDA_OFF (13u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU2_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DLMU_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU2_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DLMU_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU2_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU2_DLMU_FDA_OFF (14u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU3_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU3_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU3_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DMEM_FDA_OFF (15u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU3_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU3_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU3_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DTAG_FDA_OFF (16u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU3_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU3_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU3_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PMEM_FDA_OFF (17u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU3_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU3_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU3_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU3_PTAG_FDA_OFF (18u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU3_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DLMU_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU3_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DLMU_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU3_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU3_DLMU_FDA_OFF (19u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU4_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU4_DMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU4_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU4_DMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU4_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU4_DMEM_FDA_OFF (20u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU4_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU4_DTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU4_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU4_DTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU4_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU4_DTAG_FDA_OFF (21u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU4_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU4_PMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU4_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU4_PMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU4_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU4_PMEM_FDA_OFF (22u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU4_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU4_PTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU4_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU4_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU4_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU4_PTAG_FDA_OFF (23u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU4_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU4_DLMU_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU4_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU4_DLMU_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU4_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU4_DLMU_FDA_OFF (24u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU5_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU5_DMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU5_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU5_DMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU5_DMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU5_DMEM_FDA_OFF (25u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU5_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU5_DTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU5_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU5_DTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU5_DTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU5_DTAG_FDA_OFF (26u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU5_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU5_PMEM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU5_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU5_PMEM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU5_PMEM_FDA */
#define IFX_MTU_MEMFDA0_CPU5_PMEM_FDA_OFF (27u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU5_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU5_PTAG_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU5_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU5_PTAG_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU5_PTAG_FDA */
#define IFX_MTU_MEMFDA0_CPU5_PTAG_FDA_OFF (28u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.CPU5_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU5_DLMU_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.CPU5_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU5_DLMU_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.CPU5_DLMU_FDA */
#define IFX_MTU_MEMFDA0_CPU5_DLMU_FDA_OFF (29u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.LMU00_FDA */
#define IFX_MTU_MEMFDA0_LMU00_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.LMU00_FDA */
#define IFX_MTU_MEMFDA0_LMU00_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.LMU00_FDA */
#define IFX_MTU_MEMFDA0_LMU00_FDA_OFF (30u)

/** \brief Length for Ifx_MTU_MEMFDA0_Bits.LMU10_FDA */
#define IFX_MTU_MEMFDA0_LMU10_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA0_Bits.LMU10_FDA */
#define IFX_MTU_MEMFDA0_LMU10_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA0_Bits.LMU10_FDA */
#define IFX_MTU_MEMFDA0_LMU10_FDA_OFF (31u)

